namespace VecoBackend.Utils;

public class Strings
{
 public static string FirstSeederString =
  @"""b1r::Эстония не попадает в топы стран для эмиграции или в рейтинги самых счастливых государств мира.
 Но в этой стране больше тысячи стартапов, семь единорогов и очень комфортные условия жизни для иммигрантов из России.
 Подробнее про это расскажет Илья, python-разработчик, который в 2019 году переехал с супругой в Таллин.
 Он поделится, откуда здесь столько стартапов, как вообще живется, как обстоят дела с интеграцией в общество и как устроен быт.;;
s16::
b1m::Немного о том, как попал в Эстонию;;
s16::
b1r::Я родился и вырос в Томске, там же в политехе отучился на программиста — правда, специальность не помню,
 так как диплом не доставал с самого получения. С 2015 года я работал разработчиком в родном городе в стартапах и даже «на галере».;;
s8::
b1r::Я находился в ленивом поиске. Если подвернется что-то интересное — соглашусь, если нет — «нас и здесь неплохо кормят».
 Звали работать в Москву, Питер и Иннополис под Казанью, но я отказывался. Идея переехать в огромный мегаполис не нравилась.
 А Иннополис отмел потому, что хотелось более развитой инфраструктуры и «обжитого» пространства. Так что продолжал работать в Томске.;;
s8::
b1r::Потом меня нашли HR из какого-то агентства и предложили работу в Таллине. Одна русская компания переехала туда, чтобы быть ближе к европейским заказчикам,
 и набирала русскоязычных сотрудников. Я решил попробовать — Таллин город немногим больше Томска, и напрягал меня не так, как Москва или Питер.;;
s8::
b1r::Дальше все было стандартно: скрининг, интервью с техдиром, техническое интервью с тестовым заданием. Тестовое было объемное — реализовать у себя обработку
 платежей через внешний вымышленный платежный сервис. Особое внимание уделялось безопасности транзакций. Дали на него неделю, и я все это время над ним работал,
 по часу-два по вечерам. Потом получил по тестовому классный фидбек, в компании взяли время на подумать и в итоге пригласили меня на работу.;;
s8::
b1r::Потом я предложил, пока готовим документы, начать работать на них удаленно — чтобы зачесть это в счет испытательного срока и посмотреть, сработаемся ли.;;""";
}